---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightInfo.#ctor
source: html/9fc6131a-cdb7-27e5-1abb-d8e3d3ebba2c.htm
---
# Autodesk.Revit.DB.ExportLineweightInfo.#ctor Method

Constructs a new default ExportLineweightInfo.

## Syntax (C#)
```csharp
public ExportLineweightInfo()
```